{
    "name": "Leshy",
    "source": {
        "book": "Character Guide",
        "page": 53,
        "prd": "https://2e.aonprd.com/Ancestries.aspx?ID=14"
    },
    "hp": 8,
    "size": "small",
    "speed": 25,
    "traits": ["Uncommon", "Leshy", "Plant"],
    "bonus": [
        { "k": "ability", "ability": "CON" },
        { "k": "ability", "ability": "WIS" },
        { "k": "ability", "choice": ["STR", "DEX", "INT", "CHA"] },
        { "k": "ability_flaw", "ability": "INT" },

        { "k": "special", "id": "lowlight_vision" },
        {
            "k": "bonus",
            "category": "TODO Plant Nourishment",
            "text": "You gain nourishment in the same way that the plants or fungi that match your body type normally do, through some combination of photosynthesis, absorbing minerals with your roots, or scavenging decaying matter. You typically do not need to pay for food. If you normally rely on photosynthesis and go without sunlight for 1 week, you begin to starve. You can derive nourishment from specially formulated bottles of sunlight instead of natural sunlight, but these bottles cost 10 times as much as standard rations (or 40 sp)."
        }
    ],
    "heritages": {
        "Fungus": {
            "name": "Fungus",
            "source": {
                "book": "Character Guide",
                "page": 53,
                "prd": "https://2e.aonprd.com/Heritages.aspx?ID=45"
            },
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Your body was made from fungi that grows in the shade of caves and trees, and you are at home in dark caverns and warrens. You gain darkvision.  \n"
        },
        "Gourd": {
            "name": "Gourd",
            "source": {
                "book": "Character Guide",
                "page": 53,
                "prd": "https://2e.aonprd.com/Heritages.aspx?ID=46"
            },
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You have a large gourd for a skull. Your knowledge comes from within your spirit, rather than a physical brain, and you have found a handier use for the space inside your head. You can store a collection of up to 1 Bulk of objects within your head. The DC of checks to Steal objects from inside your head increases by 4. Additionally, if you store only one object within your head, you can draw it effortlessly into your hand as part of another action to use the object. Drawing the item grants this other action the manipulate trait.  \n"
        },
        "Leaf": {
            "name": "Leaf",
            "source": {
                "book": "Character Guide",
                "page": 53,
                "prd": "https://2e.aonprd.com/Heritages.aspx?ID=47"
            },
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Your body is made mostly from natural foliage, and like a leaf tumbling from a tree, you land from falls with particular grace. You take no damage from falling, regardless of the distance you fall.  \n"
        },
        "Vine": {
            "name": "Vine",
            "source": {
                "book": "Character Guide",
                "page": 53,
                "prd": "https://2e.aonprd.com/Heritages.aspx?ID=48"
            },
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "The prehensile vines woven into your body grant you unmatched skill at climbing. You do not need to have any hands free to Climb. Additionally, if you roll a success on an Athletics check to Climb, you get a critical success instead."
        }
    },
    "description": "*Guardians and emissaries of the environment, leshies are immortal spirits of nature temporarily granted a physical form.*\n\nLeshies are “born” when a skilled druid or other master of primal magic conducts a ritual to create a suitable vessel, and then a spirit chooses that vessel to be their temporary home. Leshies are self-sufficient from the moment the ritual ends, and so they do not depend upon these druids for care, though\n\nNot all leshies have a strong enough spirit to strike off completely on their own, however. Weaker nature spirits can form only tenuous bonds that are just strong enough to animate Tiny bodies. These spirits become leshy familiars, acting as companions to their druid creators. Independent leshies are often protective of such leshy familiars, advocating for them to be treated with dignity and respect.\n\n## You Might...\n\n* Act as a traveling agent for natural guardians who are unable to leave their territories.\n* Encourage civilizations you encounter to cooperate with nature and build their cities in ecologically friendly ways.\n* Become attached to new friends you make on your journeys.\n\n## Others Probably...\n\n* Think of you as a curiosity due to your spiritual origins.\n* Judge you by your looks, treating you sweetly if you are cute or reacting with horror if you are frightening.\n* Assume you know only about nature and are unfamiliar with civilization and society.\n\n## Physical Description\n\nLeshies are as varied as the material used to create their vessels, usually appearing as a bizarre mishmash of various plants or fungi. Their bodies are vaguely humanoid in shape, with numerous characteristics of the plant or fungus from which they were made. A typical leshy is about 3 feet tall. Due to the nature of the ritual used to create a leshy, leshies begin their lives as adults. As spirits, they do not age, and a leshy could potentially remain in the same vessel forever—though leshies rarely consider this outcome to be desirable.\n\n## Society\n\nThough guardian leshies often congregate, traveling leshies are not naturally drawn to others of their own kind. To most leshies, the concept of family is not a matter of birth, but rather determined by bonds of loyalty and friendship. Leshies are dedicated allies, but they have little tolerance for those who would despoil nature. As much as they are happy to accept someone who earns their trust into their family, they expect family members to look out for them and their natural wards in return. A betrayed leshy might not directly attack those who slight them, but they might withdraw support at a critical moment or leave their betrayers to get lost in the wilderness.\n\nLeshies are grouped into categories akin to ethnicities, but these are not connected to physical features; rather, they represent broad categories of characteristics of their spirits. Certain spirits are more likely to gravitate toward particular physical bodies, though those familiar with leshies know that this predisposition is far from absolute. Leshies often take pride in their own appearances and appreciate beauty of all kinds in others, but they rarely form judgments based on physical appearance. Leshies' genders are determined by the spirits that inhabit their bodies. Leshies tend to gravitate toward plant bodies that match their genders. Some leshies are exclusively male or female, while many consider themselves both. Others, particularly fungus leshies, tend toward far more complex expressions of gender, or eschew the concept entirely.\n\n## Alignment and Religion\n\nA leshy can be of any alignment, depending on what spirit inhabits their body, but their outlook often includes a neutral element. Religion is not particularly significant to most leshies. Those with a philosophical bent lean toward the Green Faith, and Gozreh is the most popular deity among faithful leshies. Some leshies also venerate green men, powerful spirits of nature that act as regional guardians.\n\n## Adventurers\n\nSome backgrounds are particularly suitable for adventuring leshies, especially those backgrounds with a tie to the natural world, such as hunter, nomad, or scout. Nature-themed classes such as druid and ranger are popular choices for leshies. As druids, leshies gravitate toward the leaf order. Bard is also a good fit for leshies with a love of storytelling; such leshies often inhabit vine leshy bodies.\n\n## Names\n\nLeshies choose and change their names multiple times throughout their lives. These names often represent a facet of their personalities or values, though another common naming convention is to use descriptions of a natural feature they admire. Some leshies even use a cycle of names that changes to align with natural phenomena, such as names based upon the season or the time of day.\n\n### Sample Names\n\nScarlet in Summer, Verdant Taleweaver, Lurking Hunter, Masterful Sun Drinker, Noon Sky Evening Song, Snowy Pine Branch, Cascading Rapids"
}
