{
    "name": "Investigator",
    "source": {
        "book": "Advanced Player's Guide",
        "page": 54,
        "prd": "https://2e.aonprd.com/Classes.aspx?ID=13"
    },
    "key": "INT",
    "hp": 8,
    "features": {
        "Level 1": {
            "name": "Level 1",
            "level": 1,
            "bonus": [
                { "k": "proficiency", "skill": "perception", "proficiency": "E" },
                { "k": "proficiency", "skill": "fortitude", "proficiency": "T" },
                { "k": "proficiency", "skill": "reflex", "proficiency": "E" },
                { "k": "proficiency", "skill": "will", "proficiency": "E" },
                { "k": "proficiency", "skill": "society", "proficiency": "T" },
                { "k": "proficiency", "skill": "any_skill", "proficiency": "T", "count": "4+INT" },
                {
                    "k": "proficiency",
                    "skill": "weapons",
                    "category": ["simple", "martial"],
                    "proficiency": "T"
                },
                { "k": "proficiency", "skill": "unarmed", "proficiency": "T" },
                { "k": "proficiency", "skill": "armor_light", "proficiency": "T" },
                { "k": "proficiency", "skill": "unarmored", "proficiency": "T" },
                {
                    "k": "proficiency",
                    "skill": "class_dc",
                    "class": "Investigator",
                    "proficiency": "T"
                },
                { "k": "bonus", "category": "TODO", "text": "" }
            ],
            "description": "Level 1"
        },
        "Strategic Strike": {
            "name": "Strategic Strike",
            "level": 1,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "When you strike carefully and with forethought, you deal a telling blow. When making a Strike that adds your Intelligence modifier on your attack roll due to Devising a Stratagem, you deal an additional 1d6 precision damage.\n\nAs your investigator level increases, so too does the deadliness of your strategic strike. Increase the number of dice by one at 5th, 9th, 13th, and 17th levels.  \n"
        },
        "On the Case": {
            "name": "On the Case",
            "level": 1,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "As an investigator, you think of your adventures as cases waiting to be solved. You gain one activity and one reaction you can use to investigate cases: Pursue a Lead and Clue In.\n\n### Pursue a Lead \n\n; Concentrate, Exploration, Investigator  \n**Source** *Advanced Player's Guide pg. 56*  \n**Frequency** once per 10 minutes\n\n---\n\nYou spend 1 minute examining the details of one potential clue, designating the subject related to that clue as the target of your active investigation. This subject is typically a single creature, item, or small location (such as a room or corridor), but the GM might allow a different scope for your investigation. You don't need to know the identity, purpose, or nature of the subject, but you do need to be aware of its existence. For instance, finding a footprint is enough to investigate the creature that left it, and seeing a hasty sketch of an item or location can be enough to start your investigation of that subject.\n\nWhenever you attempt a Perception or skill check to investigate a designated subject, you gain a +1 circumstance bonus to the check. The exact checks this applies to depend on the actions you use to investigate and are determined by the GM, but checks to investigate are typically Perception checks or skill checks that use Intelligence, Wisdom, or Charisma.\n\nYou can maintain two active investigations at a time. If you Pursue another Lead after that, the subject must be different from any of your current investigations (or rather, they must be different as far as you know), and you give up on a current subject of your choice. Once you've given up pursuit of a subject, you can't Pursue that Lead again until after the next time you make your daily preparations.  \n\n### Clue In :r:\n\n; Concentrate, Investigator  \n**Source** *Advanced Player's Guide pg. 56*  \n**Frequency** once per 10 minutes  \n**Trigger** Another creature attempts a check to investigate a lead you're pursuing.\n\n---\n\nYou share information with the triggering creature. They gain a circumstance bonus to their check equal to your circumstance bonus to checks investigating your subject from Pursue a Lead. The GM can add any relevant traits to this reaction depending on the situation, such as auditory and linguistic if you're conveying information verbally.  \n"
        },
        "Devise a Stratagem": {
            "name": "Devise a Stratagem",
            "level": 1,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You can play out a battle in your head, using brains rather than brawn to execute an attack.\n\n### Devise a Stratagem :a:\n\n; Concentrate, Fortune, Investigator  \n**Source** *Advanced Player's Guide pg. 56*  \n**Frequency** once per round\n\n---\n\nYou assess a foe's weaknesses in combat and use them to formulate a plan of attack against your enemy. Choose a creature you can see and roll a d20. If you Strike the chosen creature later this round, you must use the result of the roll you made to Devise a Stratagem for your Strike's attack roll instead of rolling. You make this substitution only for the first Strike you make against the creature this round, not any subsequent attacks.\n\nWhen you make this substitution, you can also add your Intelligence modifier to your attack roll instead of your Strength or Dexterity modifier, provided your Strike uses an agile or finesse melee weapon, an agile or finesse unarmed attack, a ranged weapon (which must be agile or finesse if it's a melee weapon with the thrown trait), or a sap. \n\nIf you're aware that the creature you choose is the subject of a lead you're pursuing, you can use this ability as a free action.  \n"
        },
        "Methodology": {
            "name": "Methodology",
            "level": 1,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Your studies have made you savvy in many areas, but one in particular drew your intense interest. Choose a methodology. The methodologies presented in this book are as follows.  \n"
        },
        "Level 2": {
            "name": "Level 2",
            "level": 2,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 2"
        },
        "Level 3": {
            "name": "Level 3",
            "level": 3,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 3"
        },
        "Keen Recollection": {
            "name": "Keen Recollection",
            "level": 3,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You can recall pertinent facts on topics that aren't your specialty. Your proficiency bonus to untrained skill checks to Recall Knowledge is equal to your level instead of +0.  \n"
        },
        "Skillful Lessons": {
            "name": "Skillful Lessons",
            "level": 3,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "At 3rd level and every odd-numbered level thereafter, you gain a skill feat. This feat must be for an Intelligence-, Wisdom-, or Charisma-based skill, or for the skill you gained from your methodology.  \n"
        },
        "Level 4": {
            "name": "Level 4",
            "level": 4,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 4"
        },
        "Level 5": {
            "name": "Level 5",
            "level": 5,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 5"
        },
        "Weapon Expertise": {
            "name": "Weapon Expertise",
            "level": 5,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You've dedicated yourself to learning the intricacies of your weapons. Your proficiency ranks for simple weapons, martial weapons, and unarmed attacks increase to expert.  \n"
        },
        "Level 6": {
            "name": "Level 6",
            "level": 6,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 6"
        },
        "Level 7": {
            "name": "Level 7",
            "level": 7,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 7"
        },
        "Vigilant Senses": {
            "name": "Vigilant Senses",
            "level": 7,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Through your adventures, you've developed keen awareness and attention to detail. Your proficiency rank in Perception increases to master.  \n"
        },
        "Weapon Specialization": {
            "name": "Weapon Specialization",
            "level": 7,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You can inflict greater injuries with the weapons you know best. You deal 2 additional damage with weapons and unarmed attacks in which you are an expert. This damage increases to 3 if you're a master and 4 if you're legendary.  \n"
        },
        "Level 8": {
            "name": "Level 8",
            "level": 8,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 8"
        },
        "Level 9": {
            "name": "Level 9",
            "level": 9,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 9"
        },
        "Great Fortitude": {
            "name": "Great Fortitude",
            "level": 9,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Your physique is incredibly hardy. Your proficiency rank for Fortitude saves increases to expert.  \n"
        },
        "Investigator Expertise": {
            "name": "Investigator Expertise",
            "level": 9,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You've refined your investigative techniques to an exceptional degree. Your circumstance bonus from Pursue a Lead increases to +2. Your proficiency rank for your investigator class DC increases to expert.  \n"
        },
        "Level 10": {
            "name": "Level 10",
            "level": 10,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 10"
        },
        "Level 11": {
            "name": "Level 11",
            "level": 11,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 11"
        },
        "Deductive Improvisation": {
            "name": "Deductive Improvisation",
            "level": 11,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You use your skills at deduction to perform whatever task is necessary to solve the case. You can attempt any check that requires you to be trained in a skill, even if you're untrained in it; you can attempt any check that requires you to have expert proficiency in a skill so long as you're trained in it; and you can attempt any check that requires you to have master proficiency in a skill as long as you have expert proficiency in it.  \n"
        },
        "Resolve": {
            "name": "Resolve",
            "level": 11,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You've steeled your mind with resolve. Your proficiency rank for Will saves increases to master. When you roll a success on a Will save, you get a critical success instead.  \n"
        },
        "Level 12": {
            "name": "Level 12",
            "level": 12,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 12"
        },
        "Level 13": {
            "name": "Level 13",
            "level": 13,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 13"
        },
        "Incredible Senses": {
            "name": "Incredible Senses",
            "level": 13,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You notice things that are almost impossible for an ordinary person to detect. Your proficiency rank for Perception increases to legendary.  \n"
        },
        "Light Armor Expertise": {
            "name": "Light Armor Expertise",
            "level": 13,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You've learned how to dodge while wearing light or no armor. Your proficiency ranks for light armor and unarmored defense increase to expert.  \n"
        },
        "Weapon Mastery": {
            "name": "Weapon Mastery",
            "level": 13,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You fully understand your weapons. Your proficiency ranks for simple weapons, martial weapons, and unarmed attacks increase to master.  \n"
        },
        "Level 14": {
            "name": "Level 14",
            "level": 14,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 14"
        },
        "Level 15": {
            "name": "Level 15",
            "level": 15,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 15"
        },
        "Evasion": {
            "name": "Evasion",
            "level": 15,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "You've learned to move quickly to avoid explosions, a dragon's breath, and worse. Your proficiency rank for Reflex saves increases to master. When you roll a success on a Reflex save, you get a critical success instead.  \n"
        },
        "Greater Weapon Specialization": {
            "name": "Greater Weapon Specialization",
            "level": 15,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Your damage from weapon specialization increases to 4 with weapons and unarmed attacks in which you're an expert, 6 if you're a master, and 8 if you're legendary.  \n"
        },
        "Level 16": {
            "name": "Level 16",
            "level": 16,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 16"
        },
        "Level 17": {
            "name": "Level 17",
            "level": 17,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 17"
        },
        "Greater Resolve": {
            "name": "Greater Resolve",
            "level": 17,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Your unbelievable training grants you mental resiliency. Your proficiency rank for Will saves increases to legendary. When you roll a success on a Will save, you get a critical success. When you roll a critical failure on a Will save, you get a failure instead. When you fail a Will save against a damaging effect, you take half damage.  \n"
        },
        "Level 18": {
            "name": "Level 18",
            "level": 18,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 18"
        },
        "Level 19": {
            "name": "Level 19",
            "level": 19,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 19"
        },
        "Light Armor Mastery": {
            "name": "Light Armor Mastery",
            "level": 19,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Your skill with light armor improves, increasing your ability to dodge blows. Your proficiency ranks for light armor and unarmored defense increase to master.  \n"
        },
        "Master Detective": {
            "name": "Master Detective",
            "level": 19,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "As a master detective, you can solve any case and find all the clues available. If you're pursuing the subject of a lead and you enter a new location that includes another clue toward solving the mystery, the GM informs you of the existence of the clue and its type: an object, person, spell effect, or the like. When you find the clue, the GM informs you that you've done so. If there is more than one clue in the location, the GM chooses one to inform you about. When you find any of the clues in that location, the GM informs you that you've done so, even if it wasn't the clue they'd chosen or there are other clues you haven't found. Your proficiency rank for your investigator class DC increases to master.  \n"
        },
        "Level 20": {
            "name": "Level 20",
            "level": 20,
            "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
            "description": "Level 20"
        }
    },
    "description": "# Investigator\n\n*You seek to uncover the truth, doggedly pursuing leads to reveal the plots of devious villains, discover ancient secrets, or unravel other mysteries. Your analytical mind quickly formulates solutions to complicated problems and your honed senses identify even the most obscure clues. Wielding knowledge as a weapon, you study the creatures and dangers you encounter to exploit their weaknesses.*\n\n## During Combat Encounters...\n\nYour keen insights regarding your foes make you more dangerous than your physical strength would suggest. After spending a moment to study your enemies, your perceptiveness allows you to act quickly, striking them where it hurts most. You often assist tougher members of your party, wisely protecting yourself while providing vital aid.   \n\n## During Social Encounters...\n\nFew can stand up against your scrutiny. You might not be the most charming, but you see things for what they really are and develop an understanding of a social situation rapidly. Every conversation is an investigation, after all, and you never know what you might uncover!  \n\n## While Exploring...\n\nYou look for clues in your environment. You often prove yourself to be a valuable ally by serving as a party scout, analyzing the intricacies of puzzles or mysterious phenomena, and pursuing leads that could reveal beneficial information.  \n\n## In Downtime...\n\nYou study up on subjects new and old, make new allies you can share information with, and pursue hobbies that keep your active mind satisfied. You might make a bit of coin on the side working as a private detective or consulting with the local constabulary.  \n\n## You Might...\n\n* Start asking questions—including several that are quite involved—immediately after you're presented with a conundrum.\n* Strive to uncover the deeper meanings behind anything you encounter and to identify the social machinations that truly drive events behind the scenes.\n* Get so involved in a case that you ignore other matters, deeming them trivial.\n\n## Others Probably...\n\n* Find the cascades of information you spout forth extremely helpful, if difficult to fully comprehend.\n* Get a bit annoyed that you're such a know-it-all.\n* Rely on you to solve mysteries, puzzles, or other challenges requiring intellectual curiosity and reasoning.\n\n"
}
