{
    "Just One More Thing": {
        "name": "Just One More Thing",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 63,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=1468"
        },
        "traits": ["Fortune", "Investigator"],
        "level": 10,
        "bonus": [
            { "k": "action", "name": "#self", "actions": 1 },
            { "k": "bonus", "category": "TODO", "text": "" }
        ],
        "description": "**Requirements** Your most recent action was to Feint, Request, or Demoralize, and you failed but didn't critically fail.\n\n---\n\nAfter your attempt to influence someone goes poorly, you add another bit of information or ask a pointed question, possibly salvaging your previous attempt. Reroll the failed check and use the new result. If the target of the failed check is the subject of a lead you're pursuing, double your bonus from Pursue a Lead on the rerolled check. That creature is temporarily immune to Just One More Thing for 1 day.\n\nYou can also use this action if you failed, but didn't critically fail, at a check to Lie, Gather Information, Make an Impression, or Coerce. In this case, rather than spending 1 action, adding Just One More Thing takes you half the amount of time you initially spent on the check, to a minimum of 1 more round."
    },
    "Ongoing Strategy": {
        "name": "Ongoing Strategy",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 63,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=1469"
        },
        "traits": ["Investigator"],
        "level": 10,
        "bonus": [{ "k": "bonus", "category": "TODO", "text": "" }],
        "description": "**Prerequisites** strategic strike\n\n---\n\nYou're constantly studying small aspects of everyone's movements, even if you don't have a stratagem in place ahead of time. On any Strike for which you didn't Devise a Stratagem, you still deal precision damage equal to your number of strategic strike damage dice so long as the weapon or unarmed attack you used is one that would have let you use your Intelligence modifier had you Devised a Stratagem."
    },
    "Overwhelming Energy": {
        "name": "Overwhelming Energy",
        "source": {
            "book": "Core Rulebook",
            "page": 200,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=337"
        },
        "traits": ["Druid", "Manipulate", "Metamagic", "Sorcerer", "Wizard"],
        "level": 10,
        "bonus": [{ "k": "action", "name": "#self", "actions": 1 }],
        "description": "\n\n---\n\nYou alter your spells to overcome resistances. If the next action you use is to Cast a Spell, the spell ignores an amount of the target's resistance to acid, cold, electricity, fire, or sonic damage equal to your level. This applies to all damage the spell deals, including persistent damage and damage caused by an ongoing effect of the spell, such as the wall created by *wall of fire*. A creature's immunities are unaffected."
    },
    "Quickened Casting": {
        "name": "Quickened Casting",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 80,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=199"
        },
        "traits": [
            "Bard",
            "Concentrate",
            "Metamagic",
            "Oracle",
            "Sorcerer",
            "Witch",
            "Wizard"
        ],
        "level": 10,
        "bonus": [{ "k": "action", "name": "#self", "actions": "bonus" }],
        "description": "**Frequency** once per day\n\n---\n\nIf your next action is to cast a cantrip or a spell that is at least 2 levels lower than the highest level spell you can cast, reduce the number of actions to cast it by 1 (minimum 1 action).\n\n**Special** This can only be used on a cantrip or spell from the class matching the one you gained this feat from."
    },
    "Scroll Savant": {
        "name": "Scroll Savant",
        "source": {
            "book": "Core Rulebook",
            "page": 212,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=652"
        },
        "traits": ["Wizard"],
        "level": 10,
        "prerequisites": ["skill:crafting,E"],
        "bonus": [
            {
                "k": "bonus",
                "category": "daily preparations",
                "text": "During your daily preparations, you can create two temporary scrolls containing arcane spells from your spellbook. These scrolls follow the normal rules for scrolls (page 564), with some additional restrictions. Each scroll must be of a different spell level, and both spell levels must be 2 or more levels lower than your highest-level spell. Any scrolls you create this way become non-magical the next time you make your daily preparations. A temporary scroll has no value.\n\nIf you have master proficiency in arcane spell DCs, you can create three temporary scrolls during your daily preparations, and if you have legendary proficiency, you can create four temporary scrolls."
            }
        ],
        "description": "**Prerequisites** expert in Crafting\n\n---\n\nDuring your daily preparations, you can create two temporary scrolls containing arcane spells from your spellbook. These scrolls follow the normal rules for scrolls (page 564), with some additional restrictions. Each scroll must be of a different spell level, and both spell levels must be 2 or more levels lower than your highest-level spell. Any scrolls you create this way become non-magical the next time you make your daily preparations. A temporary scroll has no value.\n\nIf you have master proficiency in arcane spell DCs, you can create three temporary scrolls during your daily preparations, and if you have legendary proficiency, you can create four temporary scrolls."
    },
    "Suspect of Opportunity": {
        "name": "Suspect of Opportunity",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 63,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=1470"
        },
        "traits": ["Investigator"],
        "level": 10,
        "bonus": [
            { "k": "action", "name": "#self", "actions": "reaction" },
            { "k": "bonus", "category": "TODO", "text": "" }
        ],
        "description": "**Frequency** once per hour  \n**Trigger** A foe takes a hostile action against you in combat.\n\n---\n\nSometimes something intrudes upon your case unexpectedly, such as an ambush sent to bring your investigation to a close. You've learned how to compartmentalize your main lead and pursue a new one for your current predicament. You Pursue a Lead against the triggering foe, setting aside but not ending one of your currently active leads, if you have two leads. At the end of the combat encounter, you stop Pursuing the Lead against the triggering foe and return to the original lead, if you have one."
    }
}
