{
    "Clever Counterspell": {
        "name": "Clever Counterspell",
        "source": {
            "book": "Core Rulebook",
            "page": 212,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=653"
        },
        "traits": ["Wizard"],
        "level": 12,
        "prerequisites": [
            "feat:Counterspell (Prepared)",
            "feat:Quick Recognition"
        ],
        "bonus": [
            {
                "k": "bonus",
                "category": "Clever Counterspell",
                "text": "Instead of being able to counter a foe's spell with Counterspell only if you have that same spell prepared, you can use Counterspell as long as you have the spell the foe is casting in your spellbook. When you use Counterspell in this way, the prepared spell you expend must share a trait other than its tradition with the triggering spell. At the GM's discretion, you can instead use a spell that has an opposing trait or that otherwise logically would counter the triggering spell (such as using a cold or water spell to counter *fireball* or using *remove fear* to counter a fear spell). Regardless of what spell you expend, you take a –2 penalty to your counteract check, though the GM can waive this penalty if the expended spell is especially appropriate."
            }
        ],
        "description": "**Prerequisites** Counterspell, Quick Recognition\n\n---\n\nYou creatively apply your prepared spells to Counterspell a much wider variety of your opponents' magic. Instead of being able to counter a foe's spell with Counterspell only if you have that same spell prepared, you can use Counterspell as long as you have the spell the foe is casting in your spellbook. When you use Counterspell in this way, the prepared spell you expend must share a trait other than its tradition with the triggering spell. At the GM's discretion, you can instead use a spell that has an opposing trait or that otherwise logically would counter the triggering spell (such as using a cold or water spell to counter *fireball* or using *remove fear* to counter a fear spell). Regardless of what spell you expend, you take a –2 penalty to your counteract check, though the GM can waive this penalty if the expended spell is especially appropriate."
    },
    "Diviner Sense": {
        "name": "Diviner Sense",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 143,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=1840"
        },
        "traits": ["Divination", "Fortune", "Wizard"],
        "level": 12,
        "bonus": [
            {
                "k": "bonus",
                "category": "TODO",
                "text": "When using the Detect Magic exploration activity, you can roll initiative twice and use the better result so long as at least one opponent has a magical effect or magic item and is in range of your *detect magic*."
            }
        ],
        "description": "\n\n---\n\nYou sense magical dangers. When using the Detect Magic exploration activity, you can roll initiative twice and use the better result so long as at least one opponent has a magical effect or magic item and is in range of your *detect magic*."
    },
    "Forcible Energy": {
        "name": "Forcible Energy",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 143,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=1841"
        },
        "traits": ["Manipulate", "Metamagic", "Wizard"],
        "level": 12,
        "bonus": [{ "k": "action", "name": "#self", "actions": 1 }],
        "description": "\n\n---\n\nYou perform complex manipulations to make the energy from your spells so powerful that your enemies remain vulnerable to it afterward. If your next action is to Cast a Spell that deals acid, electricity, fire, or sonic damage, you can select one target that was damaged to gain weakness 5 to that damage type until the end of your next turn. If a spell deals multiple types of energy damage, choose one that the target gains weakness to. This has no effect on creatures with resistance or immunity to the energy type you choose."
    },
    "Foresee Danger": {
        "name": "Foresee Danger",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 64,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=1471"
        },
        "traits": ["Concentrate", "Investigator"],
        "level": 12,
        "bonus": [
            { "k": "action", "name": "#self", "actions": "reaction" },
            { "k": "bonus", "category": "TODO", "text": "" }
        ],
        "description": "**Trigger** A creature targets you with an attack and you can see the attacker.\n\n---\n\nYou perceive every possible way your foe's attack could land and attempt to avoid them all. The triggering attack roll targets your Perception DC instead of your AC. Though this allows you to avoid taking penalties to your AC, it doesn't remove any conditions or other effects causing such penalties. For example, an enemy with sneak attack would still deal extra damage to you for being flat-footed, even though you wouldn't take the –2 circumstance penalty when defending against the attack."
    },
    "Magic Sense": {
        "name": "Magic Sense",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 80,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=622"
        },
        "traits": ["Detection", "Divination", "Oracle", "Sorcerer", "Wizard"],
        "level": 12,
        "bonus": [
            {
                "k": "bonus",
                "category": "TODO",
                "text": "You have a literal sixth sense for ambient magic in your vicinity. You can sense the presence of magic auras as though you were always using a 1st-level *detect magic* spell. This detects magic in your field of vision only. When you Seek, you gain the benefits of a 3rd-level *detect magic* spell on things you see (in addition to the normal benefits of Seeking). You can turn this sense off and on with a free action at the start or the end of your turn."
            }
        ],
        "description": "\n\n---\n\nYou have a literal sixth sense for ambient magic in your vicinity. You can sense the presence of magic auras as though you were always using a 1st-level *detect magic* spell. This detects magic in your field of vision only. When you Seek, you gain the benefits of a 3rd-level *detect magic* spell on things you see (in addition to the normal benefits of Seeking). You can turn this sense off and on with a free action at the start or the end of your turn.\n\n**Special** This feat has the trait corresponding to the tradition of spells you cast (arcane, divine, natural, or occult)."
    },
    "Reason Rapidly": {
        "name": "Reason Rapidly",
        "source": {
            "book": "Advanced Player's Guide",
            "page": 64,
            "prd": "https://2e.aonprd.com/Feats.aspx?ID=1472"
        },
        "traits": ["Investigator"],
        "level": 12,
        "bonus": [
            { "k": "action", "name": "#self", "actions": 1 },
            { "k": "bonus", "category": "TODO", "text": "" }
        ],
        "description": "\n\n---\n\nYour mind works through clues at an unbelievable speed. You instantly use up to five Recall Knowledge actions. If you have any special abilities or free actions that would normally be triggered when you Recall Knowledge, you can't use them for these actions."
    }
}
